{
  "backend/main.mo": "Defines emergency report types, stores reports in a map, and provides functions to create and query reports.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short human-written summaries for all frontend source files.",
  "frontend/index.css": "Defines Tailwind CSS base layers and custom color variables for light and dark themes.",
  "frontend/index.html": "HTML entrypoint that loads the root container and main TypeScript bundle.",
  "frontend/src/ai/analyzeEmergency.ts": "Implements keyword-based emergency classification, severity estimation, and dispatch message generation.",
  "frontend/src/ai/systemPrompt.ts": "Exports the system prompt used for AI emergency analysis with strict JSON output rules.",
  "frontend/src/App.tsx": "Sets up the app layout and routing for intake, preview, status, dashboard, and incident pages.",
  "frontend/src/components/DepartmentIcon.tsx": "Renders department-specific icons for Police, Ambulance, and Fire Station.",
  "frontend/src/components/Footer.tsx": "Displays a footer with branding, copyright, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with navigation buttons for reporting emergencies and accessing the dashboard.",
  "frontend/src/components/SeverityBadge.tsx": "Reusable badge component that displays severity with color-coded styling.",
  "frontend/src/components/StatusStepper.tsx": "Renders a vertical stepper showing emergency status progression with timestamps and current state highlighting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useGeolocation.ts": "Provides browser geolocation retrieval with stored coordinates, formatted address, and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing identity, login, logout, and status tracking through a context provider.",
  "frontend/src/hooks/useQueries.ts": "Wraps report creation, analysis retrieval, dispatch updates, and status polling using react-query and local storage.",
  "frontend/src/hooks/useVoiceInput.ts": "Implements continuous speech-to-text input using the Web Speech API with controls for listening state.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for themes and severity levels.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/DispatchPreviewPage.tsx": "Shows analysis results for a report and allows confirming dispatch, handling loading, errors, and navigation.",
  "frontend/src/pages/DispatchStatusPage.tsx": "Displays real-time dispatch status updates with periodic polling and shows department responses and progress.",
  "frontend/src/pages/IncidentDetailsPage.tsx": "Shows detailed incident analysis, metadata, and progress for a specific report.",
  "frontend/src/pages/ReportIntakePage.tsx": "Collects emergency report info including text, media, location, and contact details, then submits it.",
  "frontend/src/pages/ResponderDashboardPage.tsx": "Lists and filters all reports for responders, sorted by severity, with navigation to individual incidents.",
  "frontend/src/state/reportPersistence.ts": "Provides localStorage utilities for saving, retrieving, and listing stored emergency reports.",
  "frontend/src/state/statusEngine.ts": "Manages simulated status progression for reports based on severity-driven timing and updates history.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color tokens, extended theming, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, goals, architecture notes, required features, and image assets for an AI-powered emergency reporting web app."
}
